/*
    写一个数组的声明，把数组的某些特定位置初始化为特定的值。这个数组的名字应该叫char_value，它包含3×6×4×5个无符号字符。
    下面的表中列出的这些位置应该用相应的值进行静态初始化。
    位置        值          位置        值          位置         值
    1,2,2,3     'A'         1,1,1,1     ' '         1,3,2,2     0xf3
    2,4,3,2     '3'         1,4,2,3     '\n'        2,2,3,1     '\121'
    2,4,3,3     3           2,5,3,4     125         1,2,3,4     'x'
    2,1,1,2     0320        2,2,2,2     '\''        2,2,1,1     '0'
    那些在上面的表中未提到的位置应该被初始化为二进制值0（不是字符‘0’）。
    注意：应该使用静态初始化，在你的解决方案中不应该存在任何可执行代码！
    尽管并非解决方案的一部分，你很可能想编写一个程序，通过打印数组的值来验证它的初始化。
    由于某些值并不是可打印的字符，所以请把这些字符用整型的形式打印出来（用八进制或十六进制输出会更方便一些）。
    注意：用两种方法解决这个问题，一次在初始化列表中使用嵌套的花括号，另一次则不使用，这样你就能深刻地理解嵌套花括号的作用。
*/
#include <stdio.h>

int main(void)
{
    static unsigned char char_value[3][6][4][5] = {
        { /* 0 */ },
        { /* 1 */
            { /* 1, 0 */ },
            { /* 1, 1 */
                { /* 1, 1, 0 */ },
                { /* 1, 1, 1 */
                 // 0    1    2    3    4
                    0,   ' '
                },
            },
            { /* 1, 2 */
                { /* 1, 2, 0 */ },
                { /* 1, 2, 1 */ },
                { /* 1, 2, 2 */ 
                 // 0    1    2    3    4
                    0,   0,   0,   'A'        
                },
                { /* 1, 2, 3 */ 
                 // 0    1    2    3    4
                    0,   0,   0,   0,   'x'        
                },
            },
            { /* 1, 3 */
                { /* 1, 3, 0 */ },
                { /* 1, 3, 1 */ },
                { /* 1, 3, 2 */ 
                 // 0    1    2    3    4
                    0,   0,  0xf3
                },
            },
            { /* 1, 4 */
                { /* 1, 4, 0 */ },
                { /* 1, 4, 1 */ },
                { /* 1, 4, 2 */ 
                 // 0    1    2    3    4
                    0,   0,   0,   '\n'
                },
            }
        },
        { /* 2 */
            { /* 2, 0 */ },
            { /* 2, 1 */
                { /* 2, 1, 0 */ },
                { /* 2, 1, 1 */
                 // 0    1    2    3    4
                    0,   0,   0320
                },
            },
            { /* 2, 2 */
                { /* 2, 2, 0 */ },
                { /* 2, 2, 1 */
                 // 0    1    2    3    4
                    0,   '0'
                },
                { /* 2, 2, 2 */
                 // 0    1    2    3    4
                    0,   0,   '\''
                },
                { /* 2, 2, 3 */
                 // 0    1    2    3    4
                    0, '\121'
                },
            },
            { /* 2, 3 */ },
            { /* 2, 4 */ 
                {/* 2, 4, 0 */ },
                {/* 2, 4, 1 */ },
                {/* 2, 4, 2 */ },
                {/* 2, 4, 3 */ 
                 // 0    1    2    3    4
                    0,   0,   '3', 3
                },
            },
            { /* 2, 5 */  
                {/* 2, 5, 0 */ },
                {/* 2, 5, 1 */ },
                {/* 2, 5, 2 */ },
                {/* 2, 5, 3 */ 
                 // 0    1    2    3    4
                    0,   0,   0,   0,   125
                }
            }
        }
    };
    int num;

    for (int i = 0; i < 3; i++)
        for (int j = 0; j < 6; j++)
            for (int m = 0; m < 4; m++)
                for (int n = 0; n < 5; n++)
    {
        printf("char_value[%d][%d][%d][%d] = %d\n", i, j, m, n, char_value[i][j][m][n]);
        if (char_value[i][j][m][n] != 0) {
            printf("-------------> char_value[%d][%d][%d][%d] = %d\n", i, j, m, n, char_value[i][j][m][n]);
            num++;
        }
    }
    printf("num = %d", num);

    return 0;
}